{"case_report_title":"Case Report - NamUs UP # 14021","case_status":"Unidentified","case_number":"0447","date_found":"2012-10-16T07:00:00.000Z","date_created":"2015-07-08T19:55:00.000Z","date_last_modified":"2016-06-24T21:15:00.000Z","case_qa_reviewed_date":"2012-10-16T07:00:00.000Z","current_contact":{"agency":"Ofc Of The Brooks Cnty JP","phone":"956-722-7054"},"case_manager":{"name":"Kate Spradley","phone":"512.245.8272"},"case_estimated_age":"Adult","case_minimum_age":"40 years","case_maximum_age":" years","case_race":"Unsure","case_ethnicity":"","case_sex":"Female","case_weight":"\n\t\t\t\t\t,\n\t\t\t\t\tCannot Estimate\n\t\t\t\t","case_height":"\n\t\t\t\t\t59,\n\t\t\t\t\tEstimated\n\t\t\t\t","case_body_inventory_all_parts_recovered":"checked","case_body_condition":"Not recognizable - Near complete or complete skeleton","case_minimum_year_of_death":"\n\t\t\t\t\t\n\t\t\t\t\tto\n\t\t\t\t\t2012\n\t\t\t\t","case_postmortem_interval":"\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t","case_gps_coordinates":"","case_address_found_1":"","case_address_found_2":"","case_city_found":"","case_state_found_id":"Texas","case_zip_found":"","case_county_found_id":"Brooks","case_circumstances":"Remains found near King Ranch. ","case_hair_color":"","case_head_hair":"","case_body_hair":"","case_facial_hair":"","case_eye_color_left":"","case_eye_color_right":"","case_eye_description":"","fingerprints":"\n\t\t\t\t\t\n\t\t\t\t\t\tFingerprint information is currently not available\n\t\t\t\t\t\n\t\t\t\t","clothing_accessories":"","case_clothing_on_body":"Jeans (cuffed legs) Brand: Basic Editions: bootcut, size: 20W Short, White tag on inside of jeans \"L4\"; Shorts (workout/basketball style) with no brand or size visible; underwear (2 in number) no brand or size is visible on either underwear (black). ","case_clothing_with_body":"1 zip-up hoddie: brand: \"Courage USA\", brand on red tag with a black border \"courage\" is in black caligraphy \"USA\" is underneath it behind the lettering there is a light colored old english style lion, size: M; 2 shirts. 1st shirt: brand: \"Appropriate Behavior\", color: turquoise/blue, floral design on front, design is white with different colors of blue in the flowers. Cotton like material, clear sequins stitched into the designs;  2nd shirt: tank-top, very torn, black with red stains on back, more holes on the back than the front brand \"George\" , made in Nicaragua, 95% cotton 5% spandex, adjustable spaghetti straps, elastic material around the opening at the top, size: XL; 2 bras: 1 is mostly complete, possibly originally white, no padding, top of the cups has floral lace material, small threaded flower between the cups,2nd is light in color, no padding, more tattered, lace around the edges of both cups also floral, back is a mesh material, double pronged with thick support straps, also nylon cotton like material size, brand unknown","case_footwear":"Shoes-brand: grey/white with markings, \"Sketchers D'Lites\", written on dorsal tongue, fake gemstone dotting the \"I\" in the brand,size: 6.5US; ","case_jewelry":"1 belt: black,on 1 corner of the buckle there are 2 engraved roosters that have flowers in their beaks; 2 pairs of earrings: 1st pair: gold in color, dangly with ball at bottom, spheres and leaflike designs on top of spheres, clasped hooks. 2nd pair: gold in color, studds with small red hearts, gold metal around gemstones. 1 ring: platic, yellow in insidewoven, pink in color on band with tan on inside of band, says: \"Kalimba\" in black with a diamond shape on either side of the word, could be plastic ","case_eyewear":"","case_other_items_with_body":"1 transparent green pouch with stainless steel key ring, says \"English Motors Inc.\" with old style car all in white, containing US and MEX currency; 1 prayer card: on back \"A Nuestra Senora Del Carmen\", on front: woman with a child, text written in black. 1 safety pin with 3 metal religious charms attached: 1st (says: \"Nuestra Senora de Guadalupe\" on one side with La Virgen in btwn the words, on the back it says: \"Pray For Us\" with a flower on one side, silver in color) 2nd (Prayer written on front in Spanish: \" ¡OH! Maria Sin Pecado...\", has a male figure in btwn the words, on back : a design with a cross, hearts, stars and some sort of wood platform, silver in color), 3rd (copper in color, appears to have a Jesus emblum on it, nothing on back); 1 blister pack: 6 punched out spaces, possible brand name: \"Sedalmex\", acetaminophen, caffine. 1 tube of ointment: antibiotic ointment, brand: \"Vitacilina\", Neomycin Sulfate Ointment and \"First Aid Antibiotic\" (says on front), tube is almost empty, green and white in color; 1 phone charger: brand: \"Just Wireless\", factory # \"SKV 04205\", it is a micro USB, it has some sort of red shiny tape around the USB end of the wire, made in China; 1 photo: very small (passport size) photo of a woman's face, has dark hair and makeup on white background nothing written on back","dental":"\n\t\t\t\t\t\n\t\t\t\t\t\tDental information / charting is available and entered\n\t\t\t\t\t\n\t\t\t\t","dna":"\n\t\t\t\t\t\n\t\t\t\t\t\tSample submitted - Tests complete\n\t\t\t\t\t\n\t\t\t\t","images":["/en/medias/thumb/31128","/en/medias/thumb/31129","/en/medias/thumb/31130","/en/medias/thumb/31131","/en/medias/thumb/31132","/en/medias/thumb/31133","/en/medias/thumb/31134","/en/medias/thumb/31135","/en/medias/thumb/31136","/en/medias/thumb/31137"],"documents":"\n\t\t\t\t\n\t\t\t\t\tThere are currently no documents available for this case.<br><br><br><br>\n\t\t\t\t\n\t\t\t"}