{"case_report_title":"Case Report - NamUs UP # 2915","case_status":"Unidentified","case_number":"355 Mar 00","date_found":"2000-03-22T07:00:00.000Z","date_created":"2008-12-30T23:29:00.000Z","date_last_modified":"2014-12-16T23:00:00.000Z","case_qa_reviewed_date":"2000-03-22T07:00:00.000Z","current_contact":{"agency":"Cook Co. Medical Examiner's Office","phone":"312-666-0500"},"case_manager":{"name":"Timothy Doe","phone":"312.997.4494"},"case_estimated_age":"Adult","case_minimum_age":"18 years","case_maximum_age":"48 years","case_race":"Black/African American","case_ethnicity":"","case_sex":"Female","case_weight":"\n\t\t\t\t\t,\n\t\t\t\t\tCannot Estimate\n\t\t\t\t","case_height":"\n\t\t\t\t\t66,\n\t\t\t\t\tEstimated\n\t\t\t\t","case_body_inventory_head_not_recovered":"checked","case_body_inventory_torso_not_recovered":"checked","case_body_inventory_limbs_not_recovered":"checked","case_body_inventory_hands_not_recovered":"checked","case_body_condition":"Not recognizable - Partial remains with soft tissues","case_minimum_year_of_death":"\n\t\t\t\t\t2000\n\t\t\t\t\tto\n\t\t\t\t\t2000\n\t\t\t\t","case_postmortem_interval":"\n\t\t\t\t\t3\n\t\t\t\t\tDays\n\t\t\t\t","case_gps_coordinates":"","case_address_found_1":"1633 W. Medill Ave","case_address_found_2":"","case_city_found":"Chicago","case_state_found_id":"Illinois","case_zip_found":"","case_county_found_id":"Cook","case_circumstances":"On 22 March 2000, an employee of the Waste Management Trash Recycling Plant, located at 1635 W. Medill Avenue, Chicago, Illinois, discovered a human leg protruding from a black plastic trash bag. \nAn extensive search of more than 300 tons of garbage revealed no additional remains.\n\nUpon subsequent examination it was revealed that the bag contained a right thigh and a right lower leg with foot attached.  \n\nThe leg had been amputated from the hip and the tissue surrounding the knee was severed and the knee bone dislocated from the leg bone. The amputation wounds appeared very neat with no signs of sawing or secondary incisions.\n\nThere were ligature marks present on both sections of leg and a brownish colored polypropylene twine apparently used as tourniquets is still present.\n\nA small amount of red nail polish was present on one of the toes.\n\nPost mortem examination revealed the following:\nThigh is 18.6 inches long, weighing 8.2 pounds.\nAlong the proximal cut surface of the thigh, there are several shallow cutaneous incisions that are consistent with initial unsuccessful cutting attempts.\n\nOn the lateral and posterior aspect of the thigh, there are multiple scattered contusions which are deep, involving the entire thickness of the subcutaneous fat tissue which measure in size from 0.7 to 2.0 inches.\n\nOn the anterior and lateral aspect of the thigh there are multiple linear abrasions, which range in length from 0.5 to 3.0 inches.\n\nOn the posterior and lateral aspect of the leg, there are multiple linear abrasions, which range in length from 0.3 to 4.o inches.\n\nOn the anterolateral and proximal aspect of the leg there is an incised wound, 0.6 inches long and 0.3 to 0.4 niches deep.\n\nOn the anterior aspect of the leg there are three oval to irregular purple/blue contusions which range in size from 1 inch in greatest dimension to 4.0 x 2.0 inches. The underlying fat tissue demonstrates extensive hemorrhage through the entire thickness.\n\nThe foot is 9.6 inches long, the toenails are short and clean and on the first toenail, there is 0.1 inch residual pink/red nail polish,\n\n There is no evidence of post mortem decomposition changes in either muscle or skin.\n\nA sample was extracted  from the bone and submitted for DNA analysis. It is presently on file with the FBI.\n\nTissue sample tested positive for, Benzoylecgonine, ethanol, and cocaine.\n\nAnthropologic examination performed by Dr. Clyde Snow, assumes the leg and thigh were that of a female black between the ages of 18 and 45. Although his examination could not totally discount that the leg originated from a woman of Hispanic origin.\n\nHis findings suggest that dismemberment was carried out very skillfully with a fine bladed instrument by a person with some basic anatomical knowledge.\n\nViCAP Case Number 2012CPD00003.\nUpdate on 26 JUNE 2012 by Det. Czworniak\nA duplicate entry listed under 10349, has been deleted.\n\n\n","case_hair_color":"","case_head_hair":"","case_body_hair":"","case_facial_hair":"","case_eye_color_left":"","case_eye_color_right":"","case_eye_description":"","fingerprints":"\n\t\t\t\t\t\n\t\t\t\t\t\tFingerprint information is currently not available\n\t\t\t\t\t\n\t\t\t\t","clothing_accessories":"","case_clothing_on_body":"","case_clothing_with_body":"One brown colored high heel womans left shoe size 7B, was recovered near by. DNA testing was inconclusive if this shoe was from this Victim.\n","case_footwear":"","case_jewelry":"","case_eyewear":"","case_other_items_with_body":"","dental":"\n\t\t\t\t\t\n\t\t\t\t\t\tDental information / charting is currently not available\n\t\t\t\t\t\n\t\t\t\t","dna":"\n\t\t\t\t\t\n\t\t\t\t\t\tSample submitted - Tests complete\n\t\t\t\t\t\n\t\t\t\t","images":[],"documents":"\n\t\t\t\t\n\t\t\t\t\tThere are currently no documents available for this case.<br><br><br><br>\n\t\t\t\t\n\t\t\t"}