{"case_report_title":"Case Report - NamUs UP # 8011","case_status":"Unidentified","case_number":"2-C-3-55","date_found":"1958-10-09T13:30:00.000Z","date_created":"2010-10-13T20:52:00.000Z","date_last_modified":"2013-07-22T22:15:00.000Z","case_qa_reviewed_date":"1958-10-09T13:30:00.000Z","current_contact":{"agency":"Bedford Cnty Coroners Ofc","phone":"814-652-9384"},"case_manager":{"name":"David Clemens","phone":"814-696-6100"},"case_estimated_age":"Adult - Pre 40","case_minimum_age":"30 years","case_maximum_age":"35 years","case_race":"White","case_ethnicity":"Other","case_sex":"Male","case_weight":"\n\t\t\t\t\t,\n\t\t\t\t\tCannot Estimate\n\t\t\t\t","case_height":"\n\t\t\t\t\t76,\n\t\t\t\t\tEstimated\n\t\t\t\t","case_body_inventory_limbs_not_recovered":"checked","case_body_inventory_hands_not_recovered":"checked","case_body_condition":"Not recognizable - Partial skeletal parts only","case_minimum_year_of_death":"\n\t\t\t\t\t1957\n\t\t\t\t\tto\n\t\t\t\t\t1958\n\t\t\t\t","case_postmortem_interval":"\n\t\t\t\t\t1\n\t\t\t\t\tYears\n\t\t\t\t","case_gps_coordinates":"40 02 14      -78 29 37","case_address_found_1":"","case_address_found_2":"","case_city_found":"Bedford","case_state_found_id":"Pennsylvania","case_zip_found":"15522","case_county_found_id":"Bedford","case_circumstances":"Partial skeletal remains discovered October 9, 1958, in a wooded area approximately 1/2 mile North of the Pennsylvania Turnpike's Midway Service Plazas, Bedford Township, Bedford County, Pennsylvania.  Extensive camping equipment, personal supplies, high powered rifle and ammunition also found nearby.  Most of the camping equipment appears to be newer and shows little or no indication of use; also, though apparently well equipped for camping, investigators found no eating utensils (silverware) or food supplies.  One science-related and two poetry books found with the camping equipment suggests the victim may have benefited from higher education, or to have been a serious student of poetry or literature. There was an associated key that had been duplicated by Active Locksmiths, 195 Avenue A, New York, NY. But this was a locksmiths stamp and the unidentified person is NOT ASSOCIATED with the property at this address.\n\nInitial investigators felt certain the victim was not native to Bedford County, Pennsylvania.\n\nIn 1958, investigators determined the rifle to have been shipped from the manufacturer to a store in Fort Wayne, Indiana.  No further tracing of the rifle's ownership could be effected.\n\nAnecdotal information may connect this victim to the state of Kentucky:  Prior to the victim's discovery, in September 1957, local police in Bedford Borough encountered a loitering man in possession of a rifle; this unidentified man said he was enroute from Kentucky to Canada.\n\nAnthropologic examinations conducted in 1959 and again in 2003 revealed the victim to have been an adult male of European ancestry, likely between the ages of 30-35 with a living stature of about 6'4\" (+/- 2\").  \n\nThe death cannot be classified as natural.  \n\nGPS data is approximate.\n\nThere is no ME/C case number.  The Pennsylvania State Police incident number is 2-C-3-55.\n\nInquiries, please contact:  \n\nPennsylvania State Police, Attn: Criminal Investigation Unit, 171 Arthur L. Hershey Drive, Bedford, PA 15522, telephone 814-623-6133,\n **OR **\nPennsylvania State Police, Troop G Headquarters, Attn: Criminal Investigation Assessment Unit, 1510 North Juniata Street, Hollidaysburg, PA 16648, telephone 814-693-6100.","case_hair_color":"Unknown or Completely Bald","case_head_hair":"Scientific examiner posits:  straight hair, brown to dark brown in color.","case_body_hair":"","case_facial_hair":"","case_eye_color_left":"Unknown or Missing","case_eye_color_right":"Unknown or Missing","case_eye_description":"","case_artificial_body_parts_and_aids_details":"checked","fingerprints":"\n\t\t\t\t\t\n\t\t\t\t\t\tFingerprint information is currently not available\n\t\t\t\t\t\n\t\t\t\t","clothing_accessories":"","case_clothing_on_body":"From the initial 1958 report:  Gray wool hunting socks with red top; blue denim dungarees with wide black leather belt; white tee shirt; white jockey type shorts; black leather motorcycle type jacket with full length zipper and slant zipper pockets; no hat found.  ","case_clothing_with_body":"Numerous articles of clothing found nearby.  ","case_footwear":"From the initial 1958 report:  Black \"engineering\" boots, length 12 5/8\", width of sole 4 1/2\", heel 3 1/4 \", top height 10 1/2\", buckles on the outside.","case_jewelry":"None found.","case_eyewear":"Right corneal plastic contact lens.  Specifications (Rx) known.","case_other_items_with_body":"Extensive amount of camping equipment, toiletries, high powered rifle, ammunition, wallet containing U.S. currency and a single key.  There was an associated key that had been duplicated by Active Locksmiths, 195 Avenue A, New York, NY. But this was a locksmiths stamp and the unidentified person is NOT ASSOCIATED with the property at this address.","dental":"\n\t\t\t\t\t\n\t\t\t\t\t\tDental information / charting is available and entered\n\t\t\t\t\t\n\t\t\t\t","dna":"\n\t\t\t\t\t\n\t\t\t\t\t\tSample submitted - Tests complete\n\t\t\t\t\t\n\t\t\t\t","images":["/en/medias/thumb/7365","/en/medias/thumb/7366","/en/medias/thumb/7367","/en/medias/thumb/7368","/en/medias/thumb/7369"],"documents":"\n\t\t\t\t\n\t\t\t\t\tThere are currently no documents available for this case.<br><br><br><br>\n\t\t\t\t\n\t\t\t"}